# Databases

In [68]:
# import psycopg2 as pg
# import mariadb
import mysql.connector as mariadb
import pandas as pd
from sqlalchemy.engine import create_engine

## MariaDB

In [2]:
user = 'movie'
password = 'password'
host = 'localhost'
dbname = 'dbmovie'
port = 3307

In [14]:
conn = mariadb.connect(host=host, port=port, db=dbname, user=user, password=password)
conn

In [4]:
sql_movies_10first = "SELECT * FROM movie LIMIT 10"

In [5]:
cur = conn.cursor()
cur

In [6]:
cur.execute(sql_movies_10first)

In [7]:
for row in cur:
    print(row)

(5257, 'Excuse Me', 1915, 50, None, None, None, None, 767303)
(6366, 'Anton the Terrible', 1916, 50, None, None, None, None, 210352)
(8351, 'The Mysterious Mrs. Musslewhite', 1917, 50, None, None, None, None, 916665)
(8384, 'On the Level', 1917, 50, None, None, None, None, 577654)
(8642, 'The Sunset Trail', 1917, 50, None, None, None, None, 577654)
(8676, 'The Tides of Barnegat', 1917, 50, None, None, None, None, 624714)
(8981, 'The Cruise of the Make-Believes', 1918, 50, None, None, None, None, 577654)
(9124, 'Good Night, Paul', 1918, 50, None, None, None, None, 250445)
(9274, "A Lady's Name", 1918, 50, None, None, None, None, 250445)
(9403, "Mrs. Leffingwell's Boots", 1918, 50, None, None, None, None, 250445)

In [8]:
cur.close()

True

In [9]:
with conn.cursor() as cur:
    cur.execute(sql_movies_10first)
    for row in cur:
        print(row)

(5257, 'Excuse Me', 1915, 50, None, None, None, None, 767303)
(6366, 'Anton the Terrible', 1916, 50, None, None, None, None, 210352)
(8351, 'The Mysterious Mrs. Musslewhite', 1917, 50, None, None, None, None, 916665)
(8384, 'On the Level', 1917, 50, None, None, None, None, 577654)
(8642, 'The Sunset Trail', 1917, 50, None, None, None, None, 577654)
(8676, 'The Tides of Barnegat', 1917, 50, None, None, None, None, 624714)
(8981, 'The Cruise of the Make-Believes', 1918, 50, None, None, None, None, 577654)
(9124, 'Good Night, Paul', 1918, 50, None, None, None, None, 250445)
(9274, "A Lady's Name", 1918, 50, None, None, None, None, 250445)
(9403, "Mrs. Leffingwell's Boots", 1918, 50, None, None, None, None, 250445)

In [10]:
with conn.cursor() as cur:
    cur.execute(sql_movies_10first)
    movies = list(cur)
movies

[(5257, 'Excuse Me', 1915, 50, None, None, None, None, 767303),
 (6366, 'Anton the Terrible', 1916, 50, None, None, None, None, 210352),
 (8351,
  'The Mysterious Mrs. Musslewhite',
  1917,
  50,
  None,
  None,
  None,
  None,
  916665),
 (8384, 'On the Level', 1917, 50, None, None, None, None, 577654),
 (8642, 'The Sunset Trail', 1917, 50, None, None, None, None, 577654),
 (8676, 'The Tides of Barnegat', 1917, 50, None, None, None, None, 624714),
 (8981,
  'The Cruise of the Make-Believes',
  1918,
  50,
  None,
  None,
  None,
  None,
  577654),
 (9124, 'Good Night, Paul', 1918, 50, None, None, None, None, 250445),
 (9274, "A Lady's Name", 1918, 50, None, None, None, None, 250445),
 (9403, "Mrs. Leffingwell's Boots", 1918, 50, None, None, None, None, 250445)]

In [11]:
sql_movies_by_year = "SELECT * FROM movie WHERE year = 2000"

In [12]:
with conn.cursor() as cur:
    cur.execute(sql_movies_by_year)
    movies = list(cur)
movies

[(120755, 'Mission: Impossible II', 2000, 123, None, None, None, None, 247),
 (134630, 'Duets', 2000, 112, None, None, None, None, 1591),
 (134847, 'Pitch Black', 2000, 109, None, None, None, None, 878638),
 (138946, 'The Yards', 2000, 115, None, None, None, None, 336695),
 (146984,
  'The Legend of Bagger Vance',
  2000,
  126,
  None,
  None,
  None,
  None,
  602),
 (161081, 'What Lies Beneath', 2000, 130, None, None, None, None, 709),
 (162222, 'Cast Away', 2000, 143, None, None, None, None, 709),
 (163978, 'The Beach', 2000, 119, None, None, None, None, 965),
 (172495, 'Gladiator', 2000, 155, None, None, None, None, 631),
 (180073, 'Quills', 2000, 124, None, None, None, None, 442241),
 (181536, 'Finding Forrester', 2000, 136, None, None, None, None, 1814),
 (181984, 'Boiler Room', 2000, 120, None, None, None, None, 950226),
 (183523, 'Mission to Mars', 2000, 114, None, None, None, None, 361),
 (185431, 'Little Nicky', 2000, 90, None, None, None, None, 109359),
 (186566, 'Space Cowboys', 2000, 130, None, None, None, None, 142),
 (190590,
  'O Brother, Where Art Thou?',
  2000,
  107,
  None,
  None,
  None,
  None,
  1054),
 (208988, 'Get Carter', 2000, 102, None, None, None, None, 443181),
 (209144, 'Memento', 2000, 113, None, None, None, None, 634240),
 (216216, 'The 6th Day', 2000, 123, None, None, None, None, 6854),
 (219699, 'The Gift', 2000, 112, None, None, None, None, 600),
 (269743, 'Barking Dogs Never Bite', 2000, 110, None, None, None, None, 94435)]

### Unsecured queries with args
WARNING: SQL queries made with string concat or f-string can be attacked with SQL injection

In [6]:
sql_movies_by_year = "SELECT * FROM movie WHERE year = "

In [7]:
# year = 1984
# year = "1984 OR 1"
year = "1984; drop table if exists have_genre"
# year = """1984;
# SET FOREIGN_KEY_CHECKS=0;
# select concat('begin not atomic ', l,';end') 
# FROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l 
# FROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;
# EXECUTE IMMEDIATE @query;
# """

In [8]:
sql = sql_movies_by_year + str(year)
sql

'SELECT * FROM movie WHERE year = 1984; drop table if exists have_genre'

In [9]:
with conn.cursor() as cur:
    cur.execute(sql)
    movies = list(cur)
print("Result count:", len(movies))
movies[:2]

Result count: 16

[(84750,
  'Sword of the Valiant: The Legend of Sir Gawain and the Green Knight',
  1984,
  102,
  None,
  None,
  None,
  None,
  917358),
 (86927, 'Bachelor Party', 1984, 105, None, None, None, None, 411477)]

In [10]:
sql_movies_by_title = "SELECT * FROM movie WHERE title = '{0}'"

In [11]:
# title = "Gladiator"
# title = "' OR 1 OR title='"
title = """GLADIATOR';
SET FOREIGN_KEY_CHECKS=0;
select concat('begin not atomic ', l,';end') 
FROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l 
FROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;
EXECUTE IMMEDIATE @query;
SELECT '"""

In [12]:
sql = sql_movies_by_title.format(title)
sql

"SELECT * FROM movie WHERE title = 'GLADIATOR';\nSET FOREIGN_KEY_CHECKS=0;\nselect concat('begin not atomic ', l,';end') \nFROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l \nFROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;\nEXECUTE IMMEDIATE @query;\nSELECT ''"

In [21]:
conn.close()

### Secured query with parameters

In [28]:
sql_movies_by_year = "SELECT * FROM movie WHERE year = %s"
sql_movies_by_title = "SELECT * FROM movie WHERE title = %(title)s"

In [17]:
year1 = 1984
year2 = "1984 OR 1"
year3 = "1984; drop table if exists have_genre"
year4 = """1984;
SET FOREIGN_KEY_CHECKS=0;
select concat('begin not atomic ', l,';end') 
FROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l 
FROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;
EXECUTE IMMEDIATE @query;
"""

In [18]:
title1 = "Gladiator"
title2 = "' OR 1 OR title='"
title3 = """GLADIATOR';
SET FOREIGN_KEY_CHECKS=0;
select concat('begin not atomic ', l,';end') 
FROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l 
FROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;
EXECUTE IMMEDIATE @query;
SELECT '"""

In [35]:
def read_movies_by_year(conn, year):
    with conn.cursor() as cur:
        cur.execute(sql_movies_by_year, (year,))
        movies = list(cur)
    return movies

In [36]:
with mariadb.connect(host=host, port=port, db=dbname, user=user, password=password) as conn:
    movies =  read_movies_by_year(conn, year1)
print("Result count:", len(movies))
movies[:2]

Result count: 16

[(84750,
  'Sword of the Valiant: The Legend of Sir Gawain and the Green Knight',
  1984,
  102,
  None,
  None,
  None,
  None,
  917358),
 (86927, 'Bachelor Party', 1984, 105, None, None, None, None, 411477)]

In [38]:
with mariadb.connect(host=host, port=port, db=dbname, user=user, password=password) as conn:
    for year in year2, year3, year4:
        movies =  read_movies_by_year(conn, year)
        print("Result count:", len(movies))
        print("Result (first 2):", movies[:2])

Result count: 16
Result (first 2): [(84750, 'Sword of the Valiant: The Legend of Sir Gawain and the Green Knight', 1984, 102, None, None, None, None, 917358), (86927, 'Bachelor Party', 1984, 105, None, None, None, None, 411477)]
Result count: 16
Result (first 2): [(84750, 'Sword of the Valiant: The Legend of Sir Gawain and the Green Knight', 1984, 102, None, None, None, None, 917358), (86927, 'Bachelor Party', 1984, 105, None, None, None, None, 411477)]
Result count: 16
Result (first 2): [(84750, 'Sword of the Valiant: The Legend of Sir Gawain and the Green Knight', 1984, 102, None, None, None, None, 917358), (86927, 'Bachelor Party', 1984, 105, None, None, None, None, 411477)]

In [29]:
def read_movies_by_title(conn, title):
    with conn.cursor() as cur:
        cur.execute(sql_movies_by_title, {"title": title})
        movies = list(cur)
    return movies

In [30]:
with mariadb.connect(host=host, port=port, db=dbname, user=user, password=password) as conn:
    for title in title1, title2, title3:
        movies = read_movies_by_title(conn, title)
        print("Search movies with title:", title)
        print("Result count:", len(movies))
        print("Result (first 2):", movies[:2])
        print()

Search movies with title: Gladiator
Result count: 1
Result (first 2): [(172495, 'Gladiator', 2000, 155, None, None, None, None, 631)]

Search movies with title: ' OR 1 OR title='
Result count: 0
Result (first 2): []

Search movies with title: GLADIATOR';
SET FOREIGN_KEY_CHECKS=0;
select concat('begin not atomic ', l,';end')
FROM (SELECT GROUP_CONCAT('DROP TABLE IF EXISTS `', TABLE_NAME, '`' SEPARATOR '; ') as l
FROM information_schema.TABLES WHERE TABLE_SCHEMA = database()) as t INTO @query;
EXECUTE IMMEDIATE @query;
SELECT '
Result count: 0
Result (first 2): []

In [31]:
# INSERT INTO movie (title, year) VALUES ('Furiosa', 2024)
sql_new_movie = "INSERT INTO movie (title, year) VALUES (%(title)s, %(year)s)"

In [61]:
title = 'Furiosa: a Mad Max saga'
year = 2024
with mariadb.connect(host=host, port=port, db=dbname, user=user, password=password, autocommit=True) as conn:
    with conn.cursor() as cur:
        cur.execute(sql_new_movie, { "title": title, "year": year})
    #conn.commit()
    movies = read_movies_by_year(conn, 2024)
movies

[(8079257, 'Furiosa', 2024, None, None, None, None, None, None),
 (8079258, 'Dune: Part Two', 2024, None, None, None, None, None, None),
 (8079261,
  'Furiosa: a Mad Max saga',
  2024,
  None,
  None,
  None,
  None,
  None,
  None)]

In [59]:
mariadb.connect?

Signature: mariadb.connect(*args: 'Any', **kwargs: 'Any') -> 'Union[PooledMySQLConnection, MySQLConnectionAbstract]'
Docstring:
Creates or gets a MySQL connection object.

In its simpliest form, `connect()` will open a connection to a
MySQL server and return a `MySQLConnectionAbstract` subclass
object such as `MySQLConnection` or `CMySQLConnection`.

When any connection pooling arguments are given, for example `pool_name`
or `pool_size`, a pool is created or a previously one is used to return
a `PooledMySQLConnection`.

Args:
    *args: N/A.
    **kwargs: For a complete list of possible arguments, see [1]. If no arguments
              are given, it uses the already configured or default values.

Returns:
    A `MySQLConnectionAbstract` subclass instance (such as `MySQLConnection` or
    `CMySQLConnection`) or a `PooledMySQLConnection` instance.

Examples:
    A connection with the MySQL server can be established using either the
    `mysql.connector.connect()` method or a `MySQLConnectionAbstract` subclass:
    ```
    >>> from mysql.connector import MySQLConnection, HAVE_CEXT
    >>>
    >>> cnx1 = mysql.connector.connect(user='joe', database='test')
    >>> cnx2 = MySQLConnection(user='joe', database='test')
    >>>
    >>> cnx3 = None
    >>> if HAVE_CEXT:
    >>>     from mysql.connector import CMySQLConnection
    >>>     cnx3 = CMySQLConnection(user='joe', database='test')
    ```

References:
    [1]: https://dev.mysql.com/doc/connector-python/en/connector-python-connectargs.html
File:      c:\users\aelion\anaconda3\lib\site-packages\mysql\connector\pooling.py
Type:      function

In [55]:
conn = mariadb.connect(host=host, port=port, db=dbname, user=user, password=password)
conn.autocommit

False

In [62]:
with mariadb.connect(host=host, port=port, db=dbname, user=user, password=password) as conn:
    movies = read_movies_by_year(conn, 2024)
movies

[(8079257, 'Furiosa', 2024, None, None, None, None, None, None),
 (8079258, 'Dune: Part Two', 2024, None, None, None, None, None, None),
 (8079261,
  'Furiosa: a Mad Max saga',
  2024,
  None,
  None,
  None,
  None,
  None,
  None)]

## PostgreSQL

In [22]:
user = 'movie'
password = 'password'
host = 'localhost'
dbname = 'dbmovie'
port = 5432

In [15]:
with conn.cursor() as cur:
    cur.execute(sql)
    movies = list(cur)
print("Result count:", len(movies))
movies[:2]

Result count: 1

[(172495, 'Gladiator', 2000, 155, None, None, None, None, 631)]

In [ ]:
# TODO

## ORM: Object Relation Mapper
- SQLAlchemy: fastapi, flask, pandas
- Django ORM

### With MariaDB

In [74]:
user = 'movie'
password = 'password'
host = 'localhost'
dbname = 'dbmovie'
port = 3307
url = f"mariadb+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

In [75]:
engine = create_engine(url=url)
engine

Engine(mariadb+mysqlconnector://movie:***@localhost:3307/dbmovie)

In [79]:
# manual test
engine.connect()

In [78]:
df_movies = pd.read_sql_table('movie', con=engine)
df_movies

,id,title,year,duration,synopsis,poster_uri,color,pg,director_id
0,5257,Excuse Me,1915,50.0,None,None,None,None,767303.0
1,6366,Anton the Terrible,1916,50.0,None,None,None,None,210352.0
2,8351,The Mysterious Mrs. Musslewhite,1917,50.0,None,None,None,None,916665.0
3,8384,On the Level,1917,50.0,None,None,None,None,577654.0
4,8642,The Sunset Trail,1917,50.0,None,None,None,None,577654.0
...,...,...,...,...,...,...,...,...,...
1191,7959026,The Mule,2018,116.0,None,None,None,None,142.0
1192,8079248,Yesterday,2019,116.0,None,None,None,None,965.0
1193,8079257,Furiosa,2024,NaN,None,None,None,None,NaN
1194,8079258,Dune: Part Two,2024,NaN,None,None,None,None,NaN
1195,8079261,Furiosa: a Mad Max saga,2024,NaN,None,None,None,None,NaN

In [80]:
type(df_movies)

pandas.core.frame.DataFrame

### With PostgreSQL

In [81]:
user = 'movie'
password = 'password'
host = 'localhost'
dbname = 'dbmovie'
port = 5432
url = f"postgresql://{user}:{password}@{host}:{port}/{dbname}"

In [82]:
engine = create_engine(url=url)
with engine.connect() as conn:
    print(conn)

<sqlalchemy.engine.base.Connection object at 0x000002280A97C590>

In [83]:
df_movies = pd.read_sql_table('movie', con=engine)
df_movies

,id,title,year,duration,synopsis,poster_uri,color,pg,director_id
0,5257,Excuse Me,1915,50.0,"Henry Mallory, U.S.A., receives orders to join...",https://m.media-amazon.com/images/M/MV5BMmVmMG...,None,R,767303
1,6366,Anton the Terrible,1916,50.0,"Presumably, the first woman ever to appear in ...",https://m.media-amazon.com/images/M/MV5BMWZiZj...,None,R,210352
2,8351,The Mysterious Mrs. Musslewhite,1917,50.0,"Raymond Van Seer, wealthy, has become morose a...",https://m.media-amazon.com/images/M/MV5BMTA0Nj...,None,R,916665
3,8384,On the Level,1917,50.0,"Merlin Warner, a sheep rancher's only child, e...",https://m.media-amazon.com/images/M/MV5BMTE5ZT...,None,R,577654
4,8642,The Sunset Trail,1917,50.0,Tomboy Bess Aiken grows up quickly when her mo...,https://m.media-amazon.com/images/M/MV5BYjk3OT...,None,R,577654
...,...,...,...,...,...,...,...,...,...
1182,7763324,Amazing Stories,1986,111.0,None,https://m.media-amazon.com/images/M/MV5BMGZkZj...,None,R,213100
1183,7816392,The Bouncer,2018,94.0,The hero independently raises his little daugh...,https://m.media-amazon.com/images/M/MV5BNzU3Mz...,None,R,2182866
1184,7903530,We Die Young,2019,92.0,None,https://m.media-amazon.com/images/M/MV5BZWRjYz...,None,R,1942069
1185,7959026,The Mule,2018,116.0,"Clint Eastwood stars as Earl Stone, a man who ...",https://m.media-amazon.com/images/M/MV5BMTc1OT...,None,R,142
1186,8079248,Yesterday,2019,116.0,"In Lowestoft UK, Jack Malik is a frustrated mu...",https://m.media-amazon.com/images/M/MV5BMjQ0NT...,None,R,965

In [86]:
df_play = pd.read_sql_table('play', con=engine)
df_play

       movie_id  actor_id                 role
0          5257      1230    Lt. Harry Mallory
1          5257     85652  Mrs. Jim Wellington
2          5257    279100       Jim Wellington
3          5257    391194                 None
4          5257    547975               Porter
...         ...       ...                  ...
66542   8079248  10716846          Air Hostess
66543   8079248  10716847         Videographer
66544   8079248  10716848                 Hans
66545   8079248  10734335               Roadie
66546   8079248  11058659     Concert Reveller

[66547 rows x 3 columns]

In [87]:
sql_filmo_actor = """select
    a.id
    , a.name
    , pl.role
    , m.year
    , m.title
    , m.poster_uri
from
    movie m
    inner join play pl on pl.movie_id = m.id
    inner join person a on pl.actor_id = a.id
where
    a.name = %s
order by 
    m.year desc, m.title
"""

In [90]:
df_filmo = pd.read_sql_query(sql_filmo_actor, con=engine, params=('Steve McQueen',))
df_filmo

,id,name,role,year,title,poster_uri
0,537,Steve McQueen,Papa Thorson,1980,The Hunter,https://m.media-amazon.com/images/M/MV5BODcwNj...
1,537,Steve McQueen,Tom Horn,1980,Tom Horn,https://m.media-amazon.com/images/M/MV5BMTk5Nz...
2,537,Steve McQueen,Dr. Thomas Stockmann,1978,An Enemy of the People,https://m.media-amazon.com/images/M/MV5BNjcxY2...
3,537,Steve McQueen,Dirt-bike Rider,1976,Dixie Dynamite,https://m.media-amazon.com/images/M/MV5BMzg2OW...
4,537,Steve McQueen,Chief O''Halloran,1974,The Towering Inferno,https://m.media-amazon.com/images/M/MV5BMjA1N2...
5,537,Steve McQueen,Henri ''Papillon'' Charriere,1973,Papillon,https://m.media-amazon.com/images/M/MV5BZGRjZj...
6,537,Steve McQueen,Junior Bonner,1972,Junior Bonner,https://m.media-amazon.com/images/M/MV5BNzM1Y2...
7,537,Steve McQueen,Doc McCoy,1972,The Getaway,https://m.media-amazon.com/images/M/MV5BZWU1ND...
8,537,Steve McQueen,Michael Delaney,1971,Le Mans,https://m.media-amazon.com/images/M/MV5BNDYyOG...
9,537,Steve McQueen,Boon,1969,The Reivers,https://m.media-amazon.com/images/M/MV5BY2IwYT...
10,537,Steve McQueen,Bullitt,1968,Bullitt,https://m.media-amazon.com/images/M/MV5BMGRjYz...
11,537,Steve McQueen,Thomas Crown,1968,The Thomas Crown Affair,https://m.media-amazon.com/images/M/MV5BOTA5Nz...
12,537,Steve McQueen,Max Sand,1966,Nevada Smith,https://m.media-amazon.com/images/M/MV5BOGZkND...
13,537,Steve McQueen,Jake Holman,1966,The Sand Pebbles,https://m.media-amazon.com/images/M/MV5BNzM4NW...
14,537,Steve McQueen,Henry Thomas,1965,Baby the Rain Must Fall,https://m.media-amazon.com/images/M/MV5BNzk4Nj...
15,537,Steve McQueen,The Cincinnati Kid,1965,The Cincinnati Kid,https://m.media-amazon.com/images/M/MV5BZTEzZm...
16,537,Steve McQueen,Rocky Papasano,1963,Love with the Proper Stranger,https://m.media-amazon.com/images/M/MV5BNWU2MG...
17,537,Steve McQueen,Sgt. Eustis Clay,1963,Soldier in the Rain,https://m.media-amazon.com/images/M/MV5BMWI5MG...
18,537,Steve McQueen,Hilts ''The Cooler King'',1963,The Great Escape,https://m.media-amazon.com/images/M/MV5BNzA2Nm...
19,537,Steve McQueen,Reese,1962,Hell Is for Heroes,https://m.media-amazon.com/images/M/MV5BMzgyY2...
20,537,Steve McQueen,''Buzz'',1962,The War Lover,https://m.media-amazon.com/images/M/MV5BZDRhNz...
21,537,Steve McQueen,Lt. Ferguson ''Fergie'' Howard,1961,The Honeymoon Machine,https://m.media-amazon.com/images/M/MV5BMTg2Mj...
22,537,Steve McQueen,Vin Tanner,1960,The Magnificent Seven,https://m.media-amazon.com/images/M/MV5BMzYyNz...
23,537,Steve McQueen,Bill Ringa,1959,Never So Few,https://m.media-amazon.com/images/M/MV5BZWE1OT...
24,537,Steve McQueen,George Fowler,1959,The St. Louis Bank Robbery,https://m.media-amazon.com/images/M/MV5BZmVmZj...
25,537,Steve McQueen,Martin Cabell,1958,Never Love a Stranger,https://m.media-amazon.com/images/M/MV5BMjA5Nj...
26,537,Steve McQueen,Steve Andrews,1958,The Blob,https://m.media-amazon.com/images/M/MV5BYjI2Yj...
27,537,Steve McQueen,Fidel,1956,Somebody Up There Likes Me,https://m.media-amazon.com/images/M/MV5BMjU0Yj...
28,537,Steve McQueen,Young Man Trying to Ring the Bell,1953,Girl on the Run,https://m.media-amazon.com/images/M/MV5BMTY0Yz...

## Synchro PostgreSQL => MariaDB
Read rows from table play (db PostgreSQL) and write them in db MariaDB